In [1]:
import pandas as pd

In [11]:
Dicionario_01={ #EXERCICIO 01
    'Nomes':['Alice','Julia','Bruno','Daniel','Filipe','Silvio'],
    'Idade':[19,22,28,34,28,48],
    'Profissoes':['Direito','Engenharia','Enfermagem','Engenheiro Civil','Cientista da Computação','Engenheiro Eletrônico'],
    'ID':['1','2','3','4','5','6']
}

In [13]:
df1 = pd.DataFrame(Dicionario_01)

In [14]:
df1.head()

    Nomes  Idade               Profissoes ID
0   Alice     19                  Direito  1
1   Julia     22               Engenharia  2
2   Bruno     28               Enfermagem  3
3  Daniel     34         Engenheiro Civil  4
4  Filipe     28  Cientista da Computação  5

In [15]:
Dicionario_02={ #EXERCICIO 02
    'Produtos Fabricados':[5,30,40,100],
    'Setores':[1,2,3,4]
}

In [16]:
df2 = pd.DataFrame(Dicionario_02)

In [17]:
df2.head()

   Produtos Fabricados  Setores
0                    5        1
1                   30        2
2                   40        3
3                  100        4

In [24]:
Dicionario_03={ #EXERCICIO 03
    'ID':[1,2,3,4],          
    'Nomes':['Ana','Pedro','Maria','João'],
    'Setores':['RH', 'Vendas', 'Administrativo', 'Produção']
}
Dicionario_04={
    'ID':[1,2,3,4],
    'Salario':[3000,2800,3200,2500]
}

Label_01 = ['1ªLinha', '2ªLinha', '3ªLinha','4ªLinha']
Label_02 = ['5ªLinha', '6ªLinha', '7ªLinha','8ªLinha']

In [25]:
df1 = pd.DataFrame(Dicionario_03,index=Label_01)
df2 = pd.DataFrame(Dicionario_04,index=Label_02)

In [26]:
df1.head()

         ID  Nomes         Setores
1ªLinha   1    Ana              RH
2ªLinha   2  Pedro          Vendas
3ªLinha   3  Maria  Administrativo
4ªLinha   4   João        Produção

In [27]:
df2.head()

         ID  Salario
5ªLinha   1     3000
6ªLinha   2     2800
7ªLinha   3     3200
8ªLinha   4     2500

In [28]:
df_n2 = pd.merge(df1, df2, how='inner')

In [29]:
df_n2.head()

   ID  Nomes         Setores  Salario
0   1    Ana              RH     3000
1   2  Pedro          Vendas     2800
2   3  Maria  Administrativo     3200
3   4   João        Produção     2500